# PointCollection Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCollection Class
Members See Also
---
A class that represents a set of points created and returned by Revit in response to a query.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class PointCollection : IEnumerable<CloudPoint>,
	IDisposable
```

Visual Basic
---
```text
Public Class PointCollection _
	Implements IEnumerable(Of CloudPoint), IDisposable
```

Visual C++
---
```text
public ref class PointCollection : IEnumerable<CloudPoint>,
	IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.PointClouds..::..PointCollection
# See Also
PointCollection Members
Autodesk.Revit.DB.PointClouds Namespace